.outdated/shared/output/load-15-2025-10-26-20-29-50/k6-test-spotify.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

time="2025-10-26T20:29:50+01:00" level=info msg="CSV LOCATION:  /Users/urosceh/Code/zilla-minikube/shared/passwords/spotify/spotify.csv" source=console
time="2025-10-26T20:29:50+01:00" level=info msg="[spotify] Loaded 200 users from CSV" source=console
time="2025-10-26T20:29:50+01:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""
     execution: local
        script: /Users/urosceh/Code/zilla-minikube/shared/k6/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-10-26T20:29:50+01:00" level=info msg="[spotify] LOAD TEST SETUP" source=console
time="2025-10-26T20:29:51+01:00" level=info msg="[spotify] Admin token obtained" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:53+01:00" level=info msg="[spotify] Created 20 projects" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:54+01:00" level=info msg="Created 5 sprints for project LDT0" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:56+01:00" level=info msg="Created 50 issues for project LDT0" source=console
time="2025-10-26T20:29:56+01:00" level=info msg="Granting access for project LDT0 0. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:57+01:00" level=info msg="Granted access for project LDT0 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:58+01:00" level=info msg="Created 5 sprints for project LDT1" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:29:59+01:00" level=info msg="Created 50 issues for project LDT1" source=console
time="2025-10-26T20:29:59+01:00" level=info msg="Granting access for project LDT1 1. 10 users" source=console
time="2025-10-26T20:30:00+01:00" level=info msg="Granted access for project LDT1 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:01+01:00" level=info msg="Created 5 sprints for project LDT2" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:02+01:00" level=info msg="Created 50 issues for project LDT2" source=console
time="2025-10-26T20:30:02+01:00" level=info msg="Granting access for project LDT2 2. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:03+01:00" level=info msg="Granted access for project LDT2 to 10 users" source=console
time="2025-10-26T20:30:04+01:00" level=info msg="Created 5 sprints for project LDT3" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:05+01:00" level=info msg="Created 50 issues for project LDT3" source=console
time="2025-10-26T20:30:05+01:00" level=info msg="Granting access for project LDT3 3. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:06+01:00" level=info msg="Granted access for project LDT3 to 10 users" source=console
time="2025-10-26T20:30:07+01:00" level=info msg="Created 5 sprints for project LDT4" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:08+01:00" level=info msg="Created 50 issues for project LDT4" source=console
time="2025-10-26T20:30:08+01:00" level=info msg="Granting access for project LDT4 4. 10 users" source=console
time="2025-10-26T20:30:09+01:00" level=info msg="Granted access for project LDT4 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:10+01:00" level=info msg="Created 5 sprints for project LDT5" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:11+01:00" level=info msg="Created 50 issues for project LDT5" source=console
time="2025-10-26T20:30:11+01:00" level=info msg="Granting access for project LDT5 5. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:12+01:00" level=info msg="Granted access for project LDT5 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:13+01:00" level=info msg="Created 5 sprints for project LDT6" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:14+01:00" level=info msg="Created 50 issues for project LDT6" source=console
time="2025-10-26T20:30:14+01:00" level=info msg="Granting access for project LDT6 6. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:15+01:00" level=info msg="Granted access for project LDT6 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:16+01:00" level=info msg="Created 5 sprints for project LDT7" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:17+01:00" level=info msg="Created 50 issues for project LDT7" source=console
time="2025-10-26T20:30:17+01:00" level=info msg="Granting access for project LDT7 7. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:18+01:00" level=info msg="Granted access for project LDT7 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:18+01:00" level=info msg="Created 5 sprints for project LDT8" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:20+01:00" level=info msg="Created 50 issues for project LDT8" source=console
time="2025-10-26T20:30:20+01:00" level=info msg="Granting access for project LDT8 8. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:21+01:00" level=info msg="Granted access for project LDT8 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:21+01:00" level=info msg="Created 5 sprints for project LDT9" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:23+01:00" level=info msg="Created 50 issues for project LDT9" source=console
time="2025-10-26T20:30:23+01:00" level=info msg="Granting access for project LDT9 9. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:24+01:00" level=info msg="Granted access for project LDT9 to 10 users" source=console
time="2025-10-26T20:30:24+01:00" level=info msg="Created 5 sprints for project LDT10" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:26+01:00" level=info msg="Created 50 issues for project LDT10" source=console
time="2025-10-26T20:30:26+01:00" level=info msg="Granting access for project LDT10 10. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:27+01:00" level=info msg="Granted access for project LDT10 to 10 users" source=console
time="2025-10-26T20:30:27+01:00" level=info msg="Created 5 sprints for project LDT11" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:28+01:00" level=info msg="Created 50 issues for project LDT11" source=console
time="2025-10-26T20:30:28+01:00" level=info msg="Granting access for project LDT11 11. 10 users" source=console
time="2025-10-26T20:30:29+01:00" level=info msg="Granted access for project LDT11 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:30+01:00" level=info msg="Created 5 sprints for project LDT12" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:32+01:00" level=info msg="Created 50 issues for project LDT12" source=console
time="2025-10-26T20:30:32+01:00" level=info msg="Granting access for project LDT12 12. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:33+01:00" level=info msg="Granted access for project LDT12 to 10 users" source=console
time="2025-10-26T20:30:33+01:00" level=info msg="Created 5 sprints for project LDT13" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:35+01:00" level=info msg="Created 50 issues for project LDT13" source=console
time="2025-10-26T20:30:35+01:00" level=info msg="Granting access for project LDT13 13. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:36+01:00" level=info msg="Granted access for project LDT13 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:36+01:00" level=info msg="Created 5 sprints for project LDT14" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:38+01:00" level=info msg="Created 50 issues for project LDT14" source=console
time="2025-10-26T20:30:38+01:00" level=info msg="Granting access for project LDT14 14. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:39+01:00" level=info msg="Granted access for project LDT14 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:39+01:00" level=info msg="Created 5 sprints for project LDT15" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:41+01:00" level=info msg="Created 50 issues for project LDT15" source=console
time="2025-10-26T20:30:41+01:00" level=info msg="Granting access for project LDT15 15. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:42+01:00" level=info msg="Granted access for project LDT15 to 10 users" source=console
time="2025-10-26T20:30:42+01:00" level=info msg="Created 5 sprints for project LDT16" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:44+01:00" level=info msg="Created 50 issues for project LDT16" source=console
time="2025-10-26T20:30:44+01:00" level=info msg="Granting access for project LDT16 16. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:45+01:00" level=info msg="Granted access for project LDT16 to 10 users" source=console
time="2025-10-26T20:30:45+01:00" level=info msg="Created 5 sprints for project LDT17" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:47+01:00" level=info msg="Created 50 issues for project LDT17" source=console
time="2025-10-26T20:30:47+01:00" level=info msg="Granting access for project LDT17 17. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:48+01:00" level=info msg="Granted access for project LDT17 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:49+01:00" level=info msg="Created 5 sprints for project LDT18" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:50+01:00" level=info msg="Created 50 issues for project LDT18" source=console
time="2025-10-26T20:30:50+01:00" level=info msg="Granting access for project LDT18 18. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:51+01:00" level=info msg="Granted access for project LDT18 to 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:52+01:00" level=info msg="Created 5 sprints for project LDT19" source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:53+01:00" level=info msg="Created 50 issues for project LDT19" source=console
time="2025-10-26T20:30:53+01:00" level=info msg="Granting access for project LDT19 19. 10 users" source=console

Run       [ 100% ] setup()
default   [   0% ]
time="2025-10-26T20:30:55+01:00" level=info msg="Granted access for project LDT19 to 10 users" source=console
time="2025-10-26T20:30:55+01:00" level=info msg="[spotify] Setup complete" source=console

running (1m05.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m00.4s/3m00.0s

running (1m06.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m01.4s/3m00.0s

running (1m07.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 03/30 VUs  0m02.4s/3m00.0s

running (1m08.0s), 04/30 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 04/30 VUs  0m03.4s/3m00.0s

running (1m09.0s), 05/30 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 05/30 VUs  0m04.4s/3m00.0s

running (1m10.0s), 06/30 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 06/30 VUs  0m05.4s/3m00.0s

running (1m11.0s), 07/30 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 07/30 VUs  0m06.4s/3m00.0s

running (1m12.0s), 08/30 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 08/30 VUs  0m07.4s/3m00.0s

running (1m13.0s), 09/30 VUs, 13 complete and 0 interrupted iterations
default   [   5% ] 09/30 VUs  0m08.4s/3m00.0s

running (1m14.0s), 10/30 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 10/30 VUs  0m09.4s/3m00.0s

running (1m15.0s), 11/30 VUs, 20 complete and 0 interrupted iterations
default   [   6% ] 11/30 VUs  0m10.4s/3m00.0s

running (1m16.0s), 12/30 VUs, 22 complete and 0 interrupted iterations
default   [   6% ] 12/30 VUs  0m11.4s/3m00.0s

running (1m17.0s), 12/30 VUs, 27 complete and 0 interrupted iterations
default   [   7% ] 12/30 VUs  0m12.4s/3m00.0s

running (1m18.0s), 13/30 VUs, 30 complete and 0 interrupted iterations
default   [   7% ] 13/30 VUs  0m13.4s/3m00.0s

running (1m19.0s), 14/30 VUs, 35 complete and 0 interrupted iterations
default   [   8% ] 14/30 VUs  0m14.4s/3m00.0s

running (1m20.0s), 15/30 VUs, 40 complete and 0 interrupted iterations
default   [   9% ] 15/30 VUs  0m15.4s/3m00.0s

running (1m21.0s), 16/30 VUs, 45 complete and 0 interrupted iterations
default   [   9% ] 16/30 VUs  0m16.4s/3m00.0s

running (1m22.0s), 17/30 VUs, 49 complete and 0 interrupted iterations
default   [  10% ] 17/30 VUs  0m17.4s/3m00.0s

running (1m23.0s), 18/30 VUs, 53 complete and 0 interrupted iterations
default   [  10% ] 18/30 VUs  0m18.4s/3m00.0s

running (1m24.0s), 19/30 VUs, 55 complete and 0 interrupted iterations
default   [  11% ] 19/30 VUs  0m19.4s/3m00.0s

running (1m25.0s), 20/30 VUs, 63 complete and 0 interrupted iterations
default   [  11% ] 20/30 VUs  0m20.4s/3m00.0s

running (1m26.0s), 21/30 VUs, 67 complete and 0 interrupted iterations
default   [  12% ] 21/30 VUs  0m21.4s/3m00.0s

running (1m27.0s), 22/30 VUs, 73 complete and 0 interrupted iterations
default   [  12% ] 22/30 VUs  0m22.4s/3m00.0s

running (1m28.0s), 23/30 VUs, 77 complete and 0 interrupted iterations
default   [  13% ] 23/30 VUs  0m23.4s/3m00.0s

running (1m29.0s), 24/30 VUs, 81 complete and 0 interrupted iterations
default   [  14% ] 24/30 VUs  0m24.4s/3m00.0s

running (1m30.0s), 25/30 VUs, 90 complete and 0 interrupted iterations
default   [  14% ] 25/30 VUs  0m25.4s/3m00.0s

running (1m31.0s), 26/30 VUs, 93 complete and 0 interrupted iterations
default   [  15% ] 26/30 VUs  0m26.4s/3m00.0s

running (1m32.0s), 27/30 VUs, 100 complete and 0 interrupted iterations
default   [  15% ] 27/30 VUs  0m27.4s/3m00.0s

running (1m33.0s), 28/30 VUs, 106 complete and 0 interrupted iterations
default   [  16% ] 28/30 VUs  0m28.4s/3m00.0s

running (1m34.0s), 29/30 VUs, 110 complete and 0 interrupted iterations
default   [  16% ] 29/30 VUs  0m29.4s/3m00.0s

running (1m35.0s), 30/30 VUs, 119 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m30.4s/3m00.0s

running (1m36.0s), 30/30 VUs, 123 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  0m31.4s/3m00.0s

running (1m37.0s), 30/30 VUs, 131 complete and 0 interrupted iterations
default   [  18% ] 30/30 VUs  0m32.4s/3m00.0s

running (1m38.0s), 30/30 VUs, 137 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m33.4s/3m00.0s

running (1m39.0s), 30/30 VUs, 146 complete and 0 interrupted iterations
default   [  19% ] 30/30 VUs  0m34.4s/3m00.0s

running (1m40.0s), 30/30 VUs, 151 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m35.4s/3m00.0s

running (1m41.0s), 30/30 VUs, 157 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  0m36.4s/3m00.0s

running (1m42.0s), 30/30 VUs, 163 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m37.4s/3m00.0s

running (1m43.0s), 30/30 VUs, 177 complete and 0 interrupted iterations
default   [  21% ] 30/30 VUs  0m38.4s/3m00.0s

running (1m44.0s), 30/30 VUs, 181 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m39.4s/3m00.0s

running (1m45.0s), 30/30 VUs, 190 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  0m40.4s/3m00.0s

running (1m46.0s), 30/30 VUs, 196 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  0m41.4s/3m00.0s

running (1m47.0s), 30/30 VUs, 204 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m42.4s/3m00.0s

running (1m48.0s), 30/30 VUs, 213 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  0m43.4s/3m00.0s

running (1m49.0s), 30/30 VUs, 220 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m44.4s/3m00.0s

running (1m50.0s), 30/30 VUs, 228 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  0m45.4s/3m00.0s

running (1m51.0s), 30/30 VUs, 237 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m46.4s/3m00.0s

running (1m52.0s), 30/30 VUs, 242 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  0m47.4s/3m00.0s

running (1m53.0s), 30/30 VUs, 251 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m48.4s/3m00.0s

running (1m54.0s), 30/30 VUs, 258 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  0m49.4s/3m00.0s

running (1m55.0s), 30/30 VUs, 260 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  0m50.4s/3m00.0s

running (1m56.0s), 30/30 VUs, 267 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m51.4s/3m00.0s

running (1m57.0s), 30/30 VUs, 276 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  0m52.4s/3m00.0s

running (1m58.0s), 30/30 VUs, 282 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m53.4s/3m00.0s

running (1m59.0s), 30/30 VUs, 292 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  0m54.4s/3m00.0s

running (2m00.0s), 30/30 VUs, 302 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m55.4s/3m00.0s

running (2m01.0s), 30/30 VUs, 309 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  0m56.4s/3m00.0s

running (2m02.0s), 30/30 VUs, 313 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m57.4s/3m00.0s

running (2m03.0s), 30/30 VUs, 323 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  0m58.4s/3m00.0s

running (2m04.0s), 30/30 VUs, 331 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  0m59.4s/3m00.0s

running (2m05.0s), 30/30 VUs, 340 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m00.4s/3m00.0s

running (2m06.0s), 30/30 VUs, 350 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m01.4s/3m00.0s

running (2m07.0s), 30/30 VUs, 362 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m02.4s/3m00.0s

running (2m08.0s), 30/30 VUs, 373 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m03.4s/3m00.0s

running (2m09.0s), 30/30 VUs, 383 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m04.4s/3m00.0s

running (2m10.0s), 30/30 VUs, 400 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m05.4s/3m00.0s

running (2m11.0s), 30/30 VUs, 409 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m06.4s/3m00.0s

running (2m12.0s), 30/30 VUs, 422 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m07.4s/3m00.0s

running (2m13.0s), 30/30 VUs, 431 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m08.4s/3m00.0s

running (2m14.0s), 30/30 VUs, 448 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m09.4s/3m00.0s

running (2m15.0s), 30/30 VUs, 458 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m10.4s/3m00.0s

running (2m16.0s), 30/30 VUs, 471 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m11.4s/3m00.0s

running (2m17.0s), 30/30 VUs, 477 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m12.4s/3m00.0s

running (2m18.0s), 30/30 VUs, 485 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m13.4s/3m00.0s

running (2m19.0s), 30/30 VUs, 498 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m14.4s/3m00.0s

running (2m20.0s), 30/30 VUs, 507 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m15.4s/3m00.0s

running (2m21.0s), 30/30 VUs, 520 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m16.4s/3m00.0s

running (2m22.0s), 30/30 VUs, 531 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m17.4s/3m00.0s

running (2m23.0s), 30/30 VUs, 541 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m18.4s/3m00.0s

running (2m24.0s), 30/30 VUs, 553 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m19.4s/3m00.0s

running (2m25.0s), 30/30 VUs, 562 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m20.4s/3m00.0s

running (2m26.0s), 30/30 VUs, 575 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  1m21.4s/3m00.0s

running (2m27.0s), 30/30 VUs, 583 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m22.4s/3m00.0s

running (2m28.0s), 30/30 VUs, 601 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  1m23.4s/3m00.0s

running (2m29.0s), 30/30 VUs, 615 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m24.4s/3m00.0s

running (2m30.0s), 30/30 VUs, 622 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  1m25.4s/3m00.0s

running (2m31.0s), 30/30 VUs, 635 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  1m26.4s/3m00.0s

running (2m32.0s), 30/30 VUs, 647 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m27.4s/3m00.0s

running (2m33.0s), 30/30 VUs, 660 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  1m28.4s/3m00.0s

running (2m34.0s), 30/30 VUs, 670 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m29.4s/3m00.0s

running (2m35.0s), 30/30 VUs, 679 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  1m30.4s/3m00.0s

running (2m36.0s), 30/30 VUs, 690 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m31.4s/3m00.0s

running (2m37.0s), 30/30 VUs, 701 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  1m32.4s/3m00.0s

running (2m38.0s), 30/30 VUs, 710 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m33.4s/3m00.0s

running (2m39.0s), 30/30 VUs, 723 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  1m34.4s/3m00.0s

running (2m40.0s), 30/30 VUs, 733 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  1m35.4s/3m00.0s

running (2m41.0s), 30/30 VUs, 746 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m36.4s/3m00.0s

running (2m42.0s), 30/30 VUs, 753 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  1m37.4s/3m00.0s

running (2m43.0s), 30/30 VUs, 762 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m38.4s/3m00.0s

running (2m44.0s), 30/30 VUs, 777 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  1m39.4s/3m00.0s

running (2m45.0s), 30/30 VUs, 784 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m40.4s/3m00.0s

running (2m46.0s), 30/30 VUs, 801 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  1m41.4s/3m00.0s

running (2m47.0s), 30/30 VUs, 814 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m42.4s/3m00.0s

running (2m48.0s), 30/30 VUs, 825 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  1m43.4s/3m00.0s

running (2m49.0s), 30/30 VUs, 835 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  1m44.4s/3m00.0s

running (2m50.0s), 30/30 VUs, 844 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m45.4s/3m00.0s

running (2m51.0s), 30/30 VUs, 856 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  1m46.4s/3m00.0s

running (2m52.0s), 30/30 VUs, 865 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m47.4s/3m00.0s

running (2m53.0s), 30/30 VUs, 879 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  1m48.4s/3m00.0s

running (2m54.0s), 30/30 VUs, 890 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m49.4s/3m00.0s

running (2m55.0s), 30/30 VUs, 898 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  1m50.4s/3m00.0s

running (2m56.0s), 30/30 VUs, 909 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m51.4s/3m00.0s

running (2m57.0s), 30/30 VUs, 920 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  1m52.4s/3m00.0s

running (2m58.0s), 30/30 VUs, 928 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  1m53.4s/3m00.0s

running (2m59.0s), 30/30 VUs, 936 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m54.4s/3m00.0s

running (3m00.0s), 30/30 VUs, 946 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  1m55.4s/3m00.0s

running (3m01.0s), 30/30 VUs, 958 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m56.4s/3m00.0s

running (3m02.0s), 30/30 VUs, 966 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  1m57.4s/3m00.0s

running (3m03.0s), 30/30 VUs, 975 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m58.4s/3m00.0s

running (3m04.0s), 30/30 VUs, 982 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  1m59.4s/3m00.0s

running (3m05.0s), 30/30 VUs, 992 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m00.4s/3m00.0s

running (3m06.0s), 30/30 VUs, 1002 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  2m01.4s/3m00.0s

running (3m07.0s), 30/30 VUs, 1010 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  2m02.4s/3m00.0s

running (3m08.0s), 30/30 VUs, 1019 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m03.4s/3m00.0s

running (3m09.0s), 30/30 VUs, 1025 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  2m04.4s/3m00.0s

running (3m10.0s), 30/30 VUs, 1036 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m05.4s/3m00.0s

running (3m11.0s), 30/30 VUs, 1047 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  2m06.4s/3m00.0s

running (3m12.0s), 30/30 VUs, 1056 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m07.4s/3m00.0s

running (3m13.0s), 30/30 VUs, 1060 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  2m08.4s/3m00.0s

running (3m14.0s), 30/30 VUs, 1073 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m09.4s/3m00.0s

running (3m15.0s), 30/30 VUs, 1086 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  2m10.4s/3m00.0s

running (3m16.0s), 30/30 VUs, 1090 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  2m11.4s/3m00.0s

running (3m17.0s), 30/30 VUs, 1103 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m12.4s/3m00.0s

running (3m18.0s), 30/30 VUs, 1115 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  2m13.4s/3m00.0s

running (3m19.0s), 30/30 VUs, 1125 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m14.4s/3m00.0s

running (3m20.0s), 30/30 VUs, 1133 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  2m15.4s/3m00.0s

running (3m21.0s), 30/30 VUs, 1142 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m16.4s/3m00.0s

running (3m22.0s), 30/30 VUs, 1152 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  2m17.4s/3m00.0s

running (3m23.0s), 30/30 VUs, 1160 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m18.4s/3m00.0s

running (3m24.0s), 30/30 VUs, 1171 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  2m19.4s/3m00.0s

running (3m25.0s), 30/30 VUs, 1181 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  2m20.4s/3m00.0s

running (3m26.0s), 30/30 VUs, 1186 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m21.4s/3m00.0s

running (3m27.0s), 30/30 VUs, 1193 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  2m22.4s/3m00.0s

running (3m28.0s), 30/30 VUs, 1207 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m23.4s/3m00.0s

running (3m29.0s), 30/30 VUs, 1217 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m24.4s/3m00.0s

running (3m30.0s), 30/30 VUs, 1225 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m25.4s/3m00.0s

running (3m31.0s), 30/30 VUs, 1235 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m26.4s/3m00.0s

running (3m32.0s), 30/30 VUs, 1242 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m27.4s/3m00.0s

running (3m33.0s), 30/30 VUs, 1259 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m28.4s/3m00.0s

running (3m34.0s), 30/30 VUs, 1269 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m29.4s/3m00.0s

running (3m35.0s), 30/30 VUs, 1281 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m30.4s/3m00.0s

running (3m36.0s), 30/30 VUs, 1290 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  2m31.4s/3m00.0s

running (3m37.0s), 28/30 VUs, 1301 complete and 0 interrupted iterations
default   [  85% ] 28/30 VUs  2m32.4s/3m00.0s

running (3m38.0s), 27/30 VUs, 1313 complete and 0 interrupted iterations
default   [  85% ] 27/30 VUs  2m33.4s/3m00.0s

running (3m39.0s), 27/30 VUs, 1326 complete and 0 interrupted iterations
default   [  86% ] 27/30 VUs  2m34.4s/3m00.0s

running (3m40.0s), 27/30 VUs, 1336 complete and 0 interrupted iterations
default   [  86% ] 27/30 VUs  2m35.4s/3m00.0s

running (3m41.0s), 25/30 VUs, 1345 complete and 0 interrupted iterations
default   [  87% ] 25/30 VUs  2m36.4s/3m00.0s

running (3m42.0s), 24/30 VUs, 1356 complete and 0 interrupted iterations
default   [  87% ] 24/30 VUs  2m37.4s/3m00.0s

running (3m43.0s), 24/30 VUs, 1366 complete and 0 interrupted iterations
default   [  88% ] 24/30 VUs  2m38.4s/3m00.0s

running (3m44.0s), 23/30 VUs, 1378 complete and 0 interrupted iterations
default   [  89% ] 23/30 VUs  2m39.4s/3m00.0s

running (3m45.0s), 21/30 VUs, 1389 complete and 0 interrupted iterations
default   [  89% ] 21/30 VUs  2m40.4s/3m00.0s

running (3m46.0s), 19/30 VUs, 1399 complete and 0 interrupted iterations
default   [  90% ] 19/30 VUs  2m41.4s/3m00.0s

running (3m47.0s), 19/30 VUs, 1414 complete and 0 interrupted iterations
default   [  90% ] 19/30 VUs  2m42.4s/3m00.0s

running (3m48.0s), 18/30 VUs, 1424 complete and 0 interrupted iterations
default   [  91% ] 18/30 VUs  2m43.4s/3m00.0s

running (3m49.0s), 17/30 VUs, 1438 complete and 0 interrupted iterations
default   [  91% ] 17/30 VUs  2m44.4s/3m00.0s

running (3m50.0s), 15/30 VUs, 1455 complete and 0 interrupted iterations
default   [  92% ] 15/30 VUs  2m45.4s/3m00.0s

running (3m51.0s), 15/30 VUs, 1462 complete and 0 interrupted iterations
default   [  92% ] 15/30 VUs  2m46.4s/3m00.0s

running (3m52.0s), 14/30 VUs, 1477 complete and 0 interrupted iterations
default   [  93% ] 14/30 VUs  2m47.4s/3m00.0s

running (3m53.0s), 14/30 VUs, 1488 complete and 0 interrupted iterations
default   [  94% ] 14/30 VUs  2m48.4s/3m00.0s

running (3m54.0s), 12/30 VUs, 1503 complete and 0 interrupted iterations
default   [  94% ] 12/30 VUs  2m49.4s/3m00.0s

running (3m55.0s), 10/30 VUs, 1515 complete and 0 interrupted iterations
default   [  95% ] 10/30 VUs  2m50.4s/3m00.0s

running (3m56.0s), 09/30 VUs, 1526 complete and 0 interrupted iterations
default   [  95% ] 09/30 VUs  2m51.4s/3m00.0s

running (3m57.0s), 09/30 VUs, 1537 complete and 0 interrupted iterations
default   [  96% ] 09/30 VUs  2m52.4s/3m00.0s

running (3m58.0s), 07/30 VUs, 1551 complete and 0 interrupted iterations
default   [  96% ] 07/30 VUs  2m53.4s/3m00.0s

running (3m59.0s), 07/30 VUs, 1562 complete and 0 interrupted iterations
default   [  97% ] 07/30 VUs  2m54.4s/3m00.0s

running (4m00.0s), 05/30 VUs, 1577 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  2m55.4s/3m00.0s

running (4m01.0s), 04/30 VUs, 1591 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m56.4s/3m00.0s

running (4m02.0s), 03/30 VUs, 1604 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m57.4s/3m00.0s

running (4m03.0s), 02/30 VUs, 1616 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m58.4s/3m00.0s

running (4m04.0s), 02/30 VUs, 1625 complete and 0 interrupted iterations
default   [ 100% ] 02/30 VUs  2m59.4s/3m00.0s
time="2025-10-26T20:33:55+01:00" level=info msg="[spotify] Load test completed" source=console


  █ THRESHOLDS 

    http_req_duration{phase:test}
    ✗ 'p(95)<300' p(95)=2.01s
    ✗ 'p(99)<500' p(99)=2.46s

    http_req_failed
    ✗ 'rate<0.01' rate=2.96%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=926.19ms min=11.84ms med=914.89ms max=28.94s p(90)=1.76s p(95)=1.93s
      { expected_response:true }...: avg=933.9ms  min=11.84ms med=921.49ms max=28.94s p(90)=1.77s p(95)=1.94s
      { phase:test }...............: avg=1.25s    min=11.84ms med=1.1s     max=28.94s p(90)=1.85s p(95)=2.01s
    http_req_failed................: 2.96%  147 out of 4963
    http_reqs......................: 4963   20.293207/s

    EXECUTION
    iteration_duration.............: avg=2.77s    min=29.73ms med=2.59s    max=31.78s p(90)=4.34s p(95)=4.76s
    iterations.....................: 1635   6.68535/s
    vus............................: 2      min=0           max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 5.8 MB 24 kB/s
    data_sent......................: 2.2 MB 8.9 kB/s



running (4m04.6s), 00/30 VUs, 1635 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  3m0s
time="2025-10-26T20:33:55+01:00" level=error msg="thresholds on metrics 'http_req_duration{phase:test}, http_req_failed' have been crossed"